code-review/NRB_3471_3546/База_Было/Documents/ВыгрузкаРазделаРСВвВышестоящийДепозитарий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ВыгрузкаРазделаРСВвВышестоящийДепозитарий</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>РаскрытиеСпискаВладельцев</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РаскрытиеСпискаВладельцев</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазделСчетаДепоМХ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РазделыСчетаДепоМХ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изменил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Выгрузки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяФайла</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстФайла</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/InformationRegisters/СостоянияДокументовВФайловомШлюзе.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СостоянияДокументовВФайловомШлюзе</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыДокументовФайловыйШлюз</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пакет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ИсходящийПакетВФайловыйШлюз</v8:Type>
						<v8:Type>cfg:DocumentRef.ВходящийПакетИзФайловогоШлюза</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоИсполнения</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КоличествоЦБ</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ТехническаяОперация</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/Documents/ВыгрузкаРазделаРСВвВышестоящийДепозитарий/Ext/ObjectModule.bsl
// Формирует файлы пакета ORDSW для выгрузки в ФШ НРД по реквизитам текущего объекта
//
// Параметры:
//  Путь	- Строка	- Альтернативный путь для сохранения . Если не указан, используется каталог из внешнего источника.
//
Процедура СформироватьФайлыВыгрузки(Путь = "") Экспорт
	
	ИмяФайла = ИмяФайлаВыгрузки();
	Если Не ЗначениеЗаполнено(ИмяФайла) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось определить название пакета! Возможно отсутствует исходящий пакет ФШ.");
		Возврат;
	КонецЕсли;
	
	Текст = ТекстФайлаВыгрузки();
	
	Попытка
		Документы.ВыгрузкаРазделаРСВвВышестоящийДепозитарий.СформироватьФайлыВыгрузки(Текст, ИмяФайла, Путь);
		ЗафиксироватьВыгрузку(ИмяФайла, Текст);
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры

// Формирует название пакета ORDSW по номеру исходящего пакета, связанного с текущим объектом
// 
// Возвращаемое значение:
//  Строка - имя файла без расширения (и каталога, в который должен быть сохранён файл)
//
Функция ИмяФайлаВыгрузки() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ВыгрузкаРазделаРСВвНРД.Ссылка КАК ВыгрузкаРаздела,
	|	ТехническаяОперация.Ссылка КАК ТехническаяОперация,
	|	ИсходящийПакетВФайловыйШлюз.Номер КАК Номер,
	|	ИсходящийПакетВФайловыйШлюз.Дата КАК Дата,
	|	СостоянияДокументовВФайловомШлюзеСрезПоследних.Статус КАК Статус
	|ИЗ
	|	Документ.ВыгрузкаРазделаРСВвВышестоящийДепозитарий КАК ВыгрузкаРазделаРСВвНРД
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ТехническаяОперация КАК ТехническаяОперация
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ИсходящийПакетВФайловыйШлюз КАК ИсходящийПакетВФайловыйШлюз
	|			ПО ТехническаяОперация.Ссылка = ИсходящийПакетВФайловыйШлюз.ДокументОснование
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияДокументовВФайловомШлюзе.СрезПоследних КАК СостоянияДокументовВФайловомШлюзеСрезПоследних
	|			ПО (СостоянияДокументовВФайловомШлюзеСрезПоследних.Документ = ТехническаяОперация.Ссылка)
	|		ПО ВыгрузкаРазделаРСВвНРД.Ссылка = ТехническаяОперация.ДокументОснование
	|ГДЕ
	|	ВыгрузкаРазделаРСВвНРД.Ссылка = &Выгрузка";
	Запрос.УстановитьПараметр("Выгрузка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.Дата) И ЗначениеЗаполнено(Выборка.Номер) Тогда
		Возврат Документы.ВыгрузкаРазделаРСВвВышестоящийДепозитарий.ИмяФайлаВыгрузки(Выборка.Дата, Выборка.Номер);
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

// Функция - Текст файла выгрузки
// 
// Возвращаемое значение:
//  Строка - Текст файла выгрузки
//
Функция ТекстФайлаВыгрузки() Экспорт
	
	Раскрытие = РаскрытиеСпискаВладельцев.ПолучитьОбъект();
	
	ДанныеРСВ = Раскрытие.ВыборкаДанныхЗаполненияСводногоРСВ().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

	Попытка
		Возврат Документы.ВыгрузкаРазделаРСВвВышестоящийДепозитарий.ТекстФайлаВыгрузки(РаскрытиеСпискаВладельцев, ДанныеРСВ, РазделСчетаДепоМХ);
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
	КонецПопытки;
	
КонецФункции

// Сохраняет текст и атрибуты выгрузки в табличной части документа
//
// Параметры:
//  ИмяФайла	 - Строка	 - имя файла сохранённого пакета ORDSW
//  ТекстФайла	 - Строка	 - текст сохранённого файла пакета OEDSW
//
Процедура ЗафиксироватьВыгрузку(ИмяФайла, ТекстФайла) Экспорт
	Строка = Выгрузки.Вставить(0);
	Строка.Дата = ТекущаяДатаСеанса();
	Строка.Пользователь = ПараметрыСеанса.ТекущийПользователь;
	Строка.ИмяФайла = ИмяФайла;
	Строка.ТекстФайла = ТекстФайла;
	Записать();
КонецПроцедуры

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	Если Не ЗначениеЗаполнено(Дата) Тогда
		ВызватьИсключение "Ошибка установки номера документа, не заполнена дата документа!";
	КонецЕсли;
	Префикс = "ВРС"+Формат(Дата, "ДФ=yyMMdd");
КонецПроцедуры
